Repository: floppyFK/kittyhack
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: Failed to prepare database download: {}
de: Fehler beim vorbereiten des Datenbank-Downloads: {}

source: The original kittyflap database file does not exist.
de: Die originale Kittyflap Datenbank-Datei existiert nicht mehr.

source: Latest version check failed.
de: Überprüfung der neuesten Version fehlgeschlagen.

source: Internet connection not available.
de: Internetverbindung nicht verfügbar.

source: Retry failed: {}
de: Wiederholung fehlgeschlagen: {}

source: Remote and Kittyflap versions differ (this device: {}, target device: {}). Please update to match versions.
de: Remote- und Kittyflap-Versionen unterscheiden sich (dieses Gerät: {}, Zielgerät: {}). Bitte aktualisiere Kittyhack, um die Versionen anzugleichen.

source: Unable to fetch the latest version from github. Please try it again later or check your internet connection.
de: Die neueste Version konnte nicht von github abgerufen werden. Bitte versuche es später erneut oder überprüfe deine Internetverbindung.

source: Retry latest version check
de: Überprüfung der neuesten Version wiederholen

source: Remote/target version mismatch detected.
de: Remote-/Zielversionskonflikt erkannt.

source: You can update only one side to match versions before running a full update.
de: Du kannst nur eine Seite aktualisieren, um die Versionen anzugleichen, bevor du ein vollständiges Update durchführst.

source: Update target device only
de: Nur die Kittyflap aktualisieren

source: Update this device only
de: Nur das Remote System aktualisieren

source: Release Notes for
de: Release Notes für

source: Release notes unavailable: {}
de: Release Notes nicht verfügbar: {}

source: Automatic update to **{}**:
de: Automatisches Update auf **{}**:

source: Update Kittyhack
de: Kittyhack aktualisieren

source: Important: A stable WLAN connection is required for the update process.
de: Wichtig: Eine stabile WLAN-Verbindung ist für den Update-Prozess erforderlich.

source: The update will end with a reboot of the Kittyflap.
de: Das Update endet mit einem Neustart der Kittyflap.

source: Check out the [Changelog](https://github.com/floppyFK/kittyhack/releases) to see what's new in the latest version.
de: Lies das [Changelog](https://github.com/floppyFK/kittyhack/releases), um zu sehen, was sich in der neuesten Version geändert hat.

source: Use one of the buttons below if you want to update only one device.
de: Verwende eine der Schaltflächen unten, wenn du nur ein Gerät aktualisieren möchtest.

source: This installation does not appear to be a git clone. Automatic updates require a git repository (git clone).
de: Diese Installation scheint kein git clone zu sein. Automatische Updates erfordern ein git Repository (git clone).

source: WARNING: Local changes detected in the git repository in `{}`.
de: WARNUNG: Lokale Änderungen im git Repository in `{}` entdeckt.

source: If you proceed with the update, these changes will be lost (the database and configuration will not be affected).
de: Wenn du mit dem Update fortfährst, gehen diese Änderungen verloren (die Datenbank und Konfiguration sind davon nicht betroffen).

source: Please commit or stash your changes manually before updating, if you want to keep them.
de: Bitte sichere deine Änderungen manuell, bevor du das Update startest, wenn du sie behalten möchtest.

source: Local changes:
de: Lokale Änderungen:

source: Unable to check local git changes: {}
de: Überprüfung der lokalen git-Änderungen fehlgeschlagen: {}

source: You are already using the latest version of Kittyhack.
de: Du verwendest bereits die neueste Version von Kittyhack.

source: Use one of the buttons below to align the versions.
de: Verwende eine der Schaltflächen unten, um die Versionen anzugleichen.

source: The original kittyflap database file consumes currently **{:.1f} MB** of disk space.
de: Die originale Kittyflap Datenbank-Datei verbraucht derzeit **{:.1f} MB** Speicherplatz.

source: The file contains a lot pictures which could not be uploaded to the original kittyflap servers anymore.
de: Die Datei enthält viele Bilder, die nicht mehr auf die originalen Kittyflap-Server hochgeladen werden können.

source: You could delete the pictures from it to free up disk space.
de: Du könntest die Bilder daraus löschen, um Speicherplatz freizugeben.

source: Remove pictures from original Kittyflap Database
de: Entferne Bilder aus der originalen Kittyflap Datenbank

source: Download Kittyflap Database
de: Kittyflap Datenbank herunterladen

source: Original Kittyflap Database
de: Original Kittyflap Datenbank

source: Kittyhack is an open-source project that enables offline use of the Kittyflap cat door—completely without internet access.
de: Kittyhack ist ein Open-Source-Projekt, das die Offline-Nutzung der Kittyflap-Katzenklappe ermöglicht - ganz ohne Internetzugang.

source: It was created after the manufacturer of Kittyflap filed for bankruptcy, rendering the associated app non-functional.
de: Es wurde geschaffen, nachdem der Hersteller von Kittyflap Insolvenz angemeldet hat, was die zugehörige App funktionsunfähig machte.

source: **Important Notes**
de: **Wichtige Hinweise**

source: I have no connection to the manufacturer of Kittyflap. This project was developed on my own initiative to continue using my Kittyflap.
de: Ich stehe in keiner Verbindung zum Hersteller von Kittyflap. Dieses Projekt wurde aus eigener Initiative entwickelt, um meine Kittyflap weiter betreiben zu können.

source: If you find any bugs or have suggestions for improvement, please report them on the GitHub page.
de: Wenn du Bugs findest oder Verbesserungsvorschläge hast, melde sie bitte auf der GitHub-Seite.

source: **License**
de: **Lizenz**

source: This project is licensed under the MIT License.
de: Dieses Projekt ist unter der MIT Lizenz lizenziert.

source: MIT License (full text)
de: MIT Lizenz (vollständiger Text)

source: If you like Kittyhack, you can support the project with a small donation:
de: Wenn dir Kittyhack gefällt, kannst du das Projekt mit einer kleinen Spende unterstützen:

source: Donate via PayPal
de: Spende via PayPal

source: Version Information
de: Versionsinformationen

source: Current Version on Kittyflap
de: Aktuelle Version auf der Kittyflap

source: Remote/target versions are different. This can cause confusing update behavior.
de: Remote- und Kittyflap-Versionen sind unterschiedlich. Dies kann zu fehlverhalten bei Updates führen.

source: Show all Changelogs
de: Alle Changelogs anzeigen

source: System Information
de: Systeminformationen

source: Kittyhack Database
de: Kittyhack Datenbank

source: Backup and Restore your Kittyhack database
de: Kittyhack Datenbank sichern und wiederherstellen

source: Download Kittyhack Database
de: Kittyhack Datenbank herunterladen

source: Restore Kittyhack Database (.db)
de: Kittyhack Datenbank wiederherstellen (.db)

source: Restore Database
de: Datenbank wiederherstellen

source: Configuration File
de: Konfigurationsdatei

source: Backup and Restore your Kittyhack configuration
de: Kittyhack Konfiguration sichern und wiederherstellen

source: Download Configuration File
de: Konfigurationsdatei herunterladen

source: Restore Configuration File (config.ini)
de: Konfigurationsdatei wiederherstellen (config.ini)

source: Restore Configuration
de: Konfiguration wiederherstellen

source: > Note: If the database or the configuration gets restored from a backup, then the Kittyflap will be rebooted afterwards to apply the new configuration.
de: > Hinweis: Wenn die Datenbank oder die Konfiguration aus einem Backup wiederhergestellt wird, wird die Kittyflap anschließend neu gestartet, um die neue Konfiguration anzuwenden.

source: You can install Kittyhack as a
de: Du kannst Kittyhack als eine

source: on your Smartphone or computer for easier access.
de: auf deinem Smartphone oder Computer installieren, um den Zugriff zu erleichtern.

source: Such a PWA can be added to your home screen and launched like a native app, without needing to open a web browser.
de: Eine solche PWA kann zu deinem Startbildschirm hinzugefügt und wie eine native App gestartet werden, ohne dass ein Webbrowser geöffnet werden muss.

source: **HTTPS Required**
de: **HTTPS erforderlich**

source: PWA installation requires a secure connection (HTTPS). You are currently accessing Kittyhack via HTTP.
de: PWA-Installation erfordert eine sichere Verbindung (HTTPS). Du greifst derzeit über HTTP auf Kittyhack zu.

source: You'll need to set up a reverse proxy with HTTPS.
de: Du musst einen Reverse-Proxy mit HTTPS einrichten.

source: If you want to setup a reverse proxy in your home network, you can watch
de: Wenn du einen Reverse-Proxy in deinem Heimnetzwerk einrichten möchtest, empfehle ich dir,

source: this guide
de: dieses Video anzuschauen

source: **App is already installed on this device!**
de: **App ist bereits auf diesem Gerät installiert!**

source: **Installation successful!**
de: **Installation erfolgreich!**

source: Install as App
de: Als App installieren

source: Logfiles
de: Logdateien

source: Download Kittyhack Logfile
de: Kittyhack Logdatei herunterladen

source: Not available in remote-mode
de: Nicht im Remote-Modus verfügbar

source: Quality: {}, Signal: {} dBm
de: Qualität: {}, Signal: {} dBm

source: Unable to determine
de: Kann nicht bestimmt werden

source: Kittyhack database size
de: Kittyhack Datenbank Größe

source: Free disk space
de: Freier Speicherplatz

source: Used RAM
de: Verwendeter RAM

source: The pictures from the original kittyflap database were removed successfully.
de: Die Bilder aus der originalen Kittyflap Datenbank wurde erfolgreich gelöscht.

source: An error occurred while deleting the pictures from the original kittyflap database: {}
de: Beim löschen der Bilder aus der originalen Kittyflap Datenbank-Datei trat ein Fehler auf: {}

source: The original kittyflap database file does not exist anymore.
de: Die originale Kittyflap Datenbank-Datei existiert nicht mehr.

source: config.ini not found
de: config.ini nicht gefunden

source: Failed to download config.ini file: {}
de: Fehler beim Herunterladen der config.ini Datei: {}

source: No file selected.
de: Keine Datei ausgewählt.

source: Uploaded file not found.
de: Hochgeladene Datei nicht gefunden.

source: Invalid file type. Please upload a .db file.
de: Ungültiger Dateityp. Bitte lade eine .db Datei hoch.

source: Database file uploaded. Click 'Restore Database' to apply.
de: Datenbank-Datei hochgeladen. Klicke auf 'Datenbank wiederherstellen', um sie anzuwenden.

source: No uploaded database ready to restore.
de: Keine hochgeladene Datenbank zum Wiederherstellen bereit.

source: Database restored successfully.
de: Datenbank erfolgreich wiederhergestellt.

source: Please click the 'Reboot' button to restart the Kittyflap.
de: Bitte klicke auf den 'Neustart' Button, um die Kittyflap neu zu starten.

source: Reboot required
de: Neustart erforderlich

source: Failed to restore database: {}
de: Fehler beim Wiederherstellen der Datenbank: {}

source: Invalid file type. Please upload a config.ini file.
de: Ungültiger Dateityp. Bitte lade eine config.ini Datei hoch.

source: Invalid configuration file: missing [Settings] section.
de: Ungültige Konfigurationsdatei: fehlende [Einstellungen] Sektion.

source: Failed to validate configuration: {}
de: Fehler bei der Validierung der Konfiguration: {}

source: Configuration file uploaded. Click 'Restore Configuration' to apply.
de: Konfigurationsdatei hochgeladen. Klicke auf 'Konfiguration wiederherstellen', um sie anzuwenden.

source: No uploaded configuration ready to restore.
de: Keine hochgeladene Konfiguration zum Wiederherstellen bereit.

source: Configuration restored successfully.
de: Konfiguration erfolgreich wiederhergestellt.

source: Failed to restore configuration: {}
de: Fehler beim Wiederherstellen der Konfiguration: {}

source: Automatic update requires a git repository. Please reinstall via git clone or the setup script.
de: Automatische Updates erfordern ein git Repository. Bitte erneut über git clone oder das Setup-Skript installieren.

source: Nothing to update.
de: Nichts zu aktualisieren.

source: Target-only update is only available in remote-mode.
de: Kittyflap-Update ist nur im Remote-Modus verfügbar.

source: Starting update...
de: Starte Update...

source: Updating connected target device...
de: Aktualisiere verbundene Kittyflap...

source: Preparing remote update...
de: Vorbereiten des Kittyflap-Updates...

source: Remote target is not connected.
de: Kittyflap ist nicht verbunden.

source: Timed out while waiting for target device update.
de: Zeitüberschreitung beim Warten auf das Update der Kittyflap.

source: Unknown target update error.
de: Unbekannter Fehler beim Update der Kittyflap.

source: Target device update failed: {}.
de: Update der Kittyflap fehlgeschlagen: {}.

source: Connected target device updated.
de: Verbundene Kittyflap aktualisiert.

source: Starting update on this device...
de: Starte Update auf diesem Gerät...

source: Update finished.
de: Update abgeschlossen.

source: Connection lost while target is restarting/reconnecting. Waiting...
de: Verbindung verloren, während die Kittyflap neu startet/neu verbindet. Warte...

source: Connection to target device did not recover in time after update restart.
de: Verbindung zur Kittyflap konnte nach dem Update-Neustart nicht rechtzeitig wiederhergestellt werden.

source: Target update is running...
de: Kittyflap-Update läuft...

source: Waiting for target update to start...
de: Warte darauf, dass das Kittyflap-Update startet...

source: Waiting for remote target response...
de: Warte auf Antwort der Kittyflap...

source: Target device reconnected, but version is still {} instead of {}.
de: Kittyflap hat sich wieder verbunden, aber die Version ist immer noch {} statt {}.

source: Failed to run target update: {}.
de: Fehler beim Ausführen des Kittyflap-Updates: {}

source: Do not close this page until the update is finished!
de: Schließe diese Seite nicht, bis das Update abgeschlossen ist!

source: *This step may take several minutes. Please be patient.*
de: *Dieser Schritt kann mehrere Minuten dauern. Bitte habe Geduld.*

source: Updating Kittyhack...
de: Aktualisiere Kittyhack...

source: A restart is required to apply the update. Please click the 'Reboot' button to restart the Kittyflap.
de: Ein Neustart ist erforderlich, um das Update anzuwenden. Bitte klicke auf den 'Neustart' Button, um die Kittyflap neu zu starten.

source: An error occurred during the update process:
de: Ein Fehler ist während des Update-Prozesses aufgetreten:

source: A restart is required to recover. Please click the 'Reboot' button to restart the Kittyflap.
de: Ein Neustart ist erforderlich, um die Kittyflap wiederherzustellen. Bitte klicke auf den 'Neustart' Button, um die Kittyflap neu zu starten.

source: Live view
de: Live-Ansicht

source: Pictures
de: Bilder

source: Manage cats
de: Katzen verwalten

source: AI Training
de: KI Training

source: WLAN Configuration
de: WLAN Konfiguration

source: Toggle theme
de: Theme wechseln

source: Motion outside only
de: Nur Bewegung außen

source: Motion outside with mouse
de: Bewegung außen mit Maus

source: Cat went inside
de: Katze ist rein gegangen

source: Cat went probably inside (no motion inside detected, but the flap was unlocked)
de: Katze ist wahrscheinlich rein gegangen (keine Bewegung innen erkannt, aber die Klappe war entriegelt)

source: Cat went inside with mouse
de: Katze ist mit Maus rein gegangen

source: Cat went outside
de: Katze ist raus gegangen

source: Manually unlocked flap
de: Klappe manuell entriegelt

source: Manually locked flap
de: Klappe manuell verriegelt

source: Maximum unlock time exceeded
de: Maximale Entriegelungszeit überschritten

source: Per-cat mode: prey detection disabled for this cat
de: Pro-Katze Modus: Beuteerkennung für diese Katze deaktiviert

source: Per-cat mode: entry allowed for this cat
de: Pro-Katze Modus: Eingang für diese Katze erlaubt

source: Per-cat mode: entry denied for this cat
de: Pro-Katze Modus: Eingang für diese Katze verweigert

source: Per-cat mode: exit allowed for this cat
de: Pro-Katze Modus: Ausgang für diese Katze erlaubt

source: Per-cat mode: exit denied for this cat
de: Pro-Katze Modus: Ausgang für diese Katze verweigert

source: Unknown event
de: Unbekanntes Ereignis

source: Model downloaded
de: Modell heruntergeladen

source: Model training completed and the new model was downloaded successfully. You can select it now in the 'Configuration' section.
de: Modelltraining abgeschlossen und das neue Modell wurde erfolgreich heruntergeladen. Du kannst es jetzt im Abschnitt 'Konfiguration' auswählen.

source: Model download failed
de: Modell konnte nicht heruntergeladen werden

source: Model training completed, but the model could not be downloaded. Please retry later.
de: Modelltraining abgeschlossen, aber das Modell konnte nicht heruntergeladen werden. Bitte versuche es später erneut.

source: Model Training Aborted
de: Modelltraining abgebrochen

source: The model training was aborted. This can happen if the provided training data was not correct. Please ensure you have exported the data from Label Studio as **'YOLO with Images'** and that your labels are set correctly in the images.
de: Das Modelltraining wurde abgebrochen. Dies kann passieren, wenn die bereitgestellten Trainingsdaten nicht korrekt waren. Bitte stelle sicher, dass du die Daten aus Label Studio als **'YOLO mit Bildern'** exportiert hast und dass deine Labels in den Bildern korrekt gesetzt sind.

source: Model training is in progress. Please check back later.
de: Das Modelltraining ist im Gange. Bitte schaue später wieder vorbei.

source: The training is pending and will start soon.
de: Das Training ist eingereiht und wird bald starten.

source: The training is queued and waiting for resources.
de: Das Training ist in der Warteschlange und wartet auf Ressourcen.

source: The training has been successfully completed.
de: Das Training wurde erfolgreich abgeschlossen.

source: Training completed. Downloading the model…
de: Modelltraining abgeschlossen. Lade das Modell herunter…

source: Training completed. Installing the model…
de: Modelltraining abgeschlossen. Installiere das Modell…

source: Training completed. Model downloaded and installed.
de: Modelltraining abgeschlossen. Modell heruntergeladen und installiert.

source: Training completed, but the model download failed.
de: Modelltraining abgeschlossen, aber der Modell-Download ist fehlgeschlagen.

source: The training was aborted. Please try again.
de: Das Training wurde abgebrochen. Bitte versuche es erneut.

source: The training status is unknown. Please check back later.
de: Der Trainingsstatus ist unbekannt. Bitte schaue später wieder vorbei.

source: No model training is in progress.
de: Kein Modelltraining ist im Gange.

source: Stopping existing Label Studio service...
de: Stoppe den bestehenden Label Studio Dienst...

source: Removing existing Label Studio installation...
de: Label Studio Installation wird entfernt...

source: Starting Label Studio installation...
de: Starte die Label Studio Installation...

source: This may take a few minutes...
de: Dies kann ein paar Minuten dauern...

source: Creating virtual environment...
de: Virtuelle Umgebung wird erstellt...

source: This may take a moment...
de: Dies kann einen Moment dauern...

source: Virtual environment already exists
de: Virtuelle Umgebung existiert bereits

source: Skipping creation...
de: Überspringe Erstellung...

source: Upgrading pip...
de: Pip wird aktualisiert...

source: Installing Label Studio...
de: Label Studio wird installiert...

source: This takes several minutes... Do not turn off the power or reload the page!
de: Dies dauert mehrere Minuten... Schalte den Strom nicht aus und lade die Seite nicht neu!

source: Creating systemd service...
de: Systemd Service wird erstellt...

source: Almost done...
de: Fast fertig...

source: Service file created successfully.
de: Service-Datei erfolgreich erstellt.

source: Error: Template file not found.
de: Fehler: Template Datei nicht gefunden.

source: Reloading systemd services...
de: Systemd Dienste werden neu geladen...

source: Starting Label Studio update...
de: Starte Label Studio Update...

source: Upgrading Label Studio...
de: Label Studio wird aktualisiert...
