Repository: floppyFK/kittyhack
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: Only tries to detect objects `Mouse` and `No Mouse` if there is a cat in the picture.
de: Versucht nur, Objekte `Maus` und `Keine Maus` zu erkennen, wenn eine Katze im Bild erkannt wird.

source: Custom Models:
de: Benutzerdefinierte Modelle:

source: These are your own trained models, which you have created in the `AI TRAINING` section.
de: Dies sind deine eigenen trainierten Modelle, die du im Abschnitt `KI TRAINING` erstellt hast.

source: If you change this setting, the Kittyflap must be restarted to apply the new model version.
de: Wenn du diese Einstellung änderst, muss die Kittyflap neu gestartet werden, um die neue Modellversion anzuwenden.

source: Use camera for cat detection
de: Kamera für die Katzenerkennung verwenden

source: Explain camera cat detection
de: Erklärung für die Kamera-Katzenerkennung

source: If this setting is enabled, the camera will also be used for cat detection (in addition to the RFID reader).
de: Wenn diese Einstellung aktiviert ist, wird auch die Kamera zur Katzenerkennung verwendet (neben dem RFID-Leser).

source: You can configure the required threshold for the cat detection with the slider `Cat detection threshold`.
de: Du kannst den erforderlichen Schwellwert für die Katzenerkennung mit dem Schieberegler `Schwellwert für Katzenerkennung` konfigurieren.

source: If the detection is successful, the inside direction will be opened.
de: Wenn die Erkennung erfolgreich ist, wird die Klappe nach innen geöffnet.

source: **NOTE:** This feature requires a custom trained model for your cat(s). It does not work with the default kittyflap models.
de: **HINWEIS:** Diese Funktion erfordert ein benutzerdefiniertes trainiertes Modell für deine Katze(n). Sie funktioniert nicht mit den Standard-Kittyflap-Modellen.

source: This feature depends heavily on the quality of your model and sufficient lighting conditions.
de: Diese Funktion hängt stark von der Qualität deines Modells und ausreichenden Beleuchtungsbedingungen ab.

source: If one or both are not good, the detection may either fail or other - similiar looking cats may be detected as your cat.
de: Wenn ein oder beide Kriterien nicht gut erfüllt sind, kann die Erkennung entweder fehlschlagen oder andere - ähnlich aussehende Katzen - als deine Katze erkannt werden.

source: Use camera for motion detection
de: Kamera für die Bewegungserkennung verwenden

source: Explain camera motion detection
de: Erklärung für die Kamera-Bewegungserkennung

source: Disables the outside PIR sensor and uses the camera for motion detection instead.
de: Deaktiviert den äußeren PIR-Sensor und verwendet stattdessen die Kamera zur Bewegungserkennung.

source: **How it works:**
de: **So funktioniert es:**

source: - In regular operation, Kittyhack waits for a trigger from the outside PIR sensor before starting camera analysis
de: - Normalerweise wartet Kittyhack auf einen Auslöser vom äußeren PIR-Sensor, bevor die Kameraanalyse gestartet wird.

source: - With this feature enabled, the PIR sensor is disabled and the camera continuously analyzes images
de: - Mit dieser Funktion ist der PIR-Sensor deaktiviert und die Kamera analysiert kontinuierlich Bilder

source: - When a cat is detected in the camera feed, it's treated as equivalent to a motion detection outside
de: - Wenn eine Katze im Kamerabild erkannt wird, wird dies als äquivalent zu einer Bewegungserkennung außen behandelt

source: This may be very helpful in areas where environmental factors (moving trees, people passing by) permanently cause false PIR triggers.
de: Dies kann sehr hilfreich sein in Gebieten, in denen Umweltfaktoren (bewegende Bäume im Wind, vorbeigehende Personen) ständig zu falschen PIR-Auslösern führen.

source: If one or both are not good, you may experience false triggers or your cat may not be detected correctly.
de: Wenn eines oder beide Kriterien nicht gut erfüllt sind, können Fehlauslöser auftreten oder deine Katze wird möglicherweise nicht korrekt erkannt.

source: Open inside direction for:
de: Eingangsrichtung öffnen für:

source: Explain entrance modes
de: Erklärung der Eingangsmodi

source: - **All cats:** *Every* detected motion on the outside will unlock the flap.
de: - **Alle Katzen:** *Jede* erkannte Bewegung auf der Außenseite wird die Klappe öffnen.

source: - **All cats with a RFID chip:** Every successful RFID detection will unlock the flap.
de: - **Alle Katzen mit RFID Chip:** Jede erfolgreiche RFID-Erkennung wird die Klappe öffnen.

source: - **Only registered cats:** Only the cats that are registered in the database will unlock the flap (either by RFID or by camera detection, if enabled).
de: - **Nur registrierte Katzen:** Nur die Katzen, die in der Datenbank registriert sind, werden die Klappe öffnen können (entweder per RFID oder per Kameraerkennung, wenn aktiviert).

source: - **Individual configuration per cat:** Configure per cat if it is allowed to enter (in the `MANAGE CATS` section).
de: - **Individuelle Konfiguration pro Katze:** Konfiguriere pro Katze, ob sie eintreten darf (im Abschnitt `KATZEN VERWALTEN`).

source: - **No cats:** The inside direction will never be opened.
de: - **Keine Katzen:** Die Eingangsrichtung wird nie geöffnet.

source: Show decision logic
de: Entscheidungslogik anzeigen

source: Hide decision logic
de: Entscheidungslogik ausblenden

source: Only the flowchart for the currently selected mode is shown.
de: Es wird nur das Flussdiagramm für den aktuell ausgewählten Modus angezeigt.

source: Explain exit modes
de: Erklärung der Ausgangsmodi

source: - **Allow exit:** The outside direction is always possible. You can also configure time ranges below to restrict the exit times.
de: - **Ausgang erlauben:** Der Ausgang ist immer möglich. Du kannst auch unten Zeitbereiche konfigurieren, um die Ausgangszeiten zu beschränken.

source: - **Do not allow exit:** The outside direction is always closed.
de: - **Ausgang nicht erlauben:** Die Ausgangsrichtung ist immer geschlossen.

source: - **Individual configuration per cat:** Configure per cat if it is allowed to exit (in the `MANAGE CATS` section). The time ranges below are applied in addition.
de: - **Individuelle Konfiguration pro Katze:** Konfiguriere pro Katze, ob sie den Ausgang benutzen darf (im Abschnitt `KATZEN VERWALTEN`). Die unten angegebenen Zeitbereiche werden zusätzlich angewendet.

source: **NOTE:** All your cats must be registered **with a RFID chip** to use this mode. Cats without RFID can not go outside in this mode!
de: **HINWEIS:** Alle deine Katzen müssen **mit einem RFID-Chip** registriert sein, um diesen Modus zu verwenden. Katzen ohne RFID können in diesem Modus nicht nach draußen gehen!

source: Show exit time range rules
de: Regeln für Ausgangszeitbereiche anzeigen

source: You can specify up to 3 time ranges, in which your cats are allowed to exit.
de: Du kannst bis zu 3 Zeitbereiche angeben, in denen deine Katzen nach draußen gehen dürfen.

source: Rules:
de: Regeln:

source: The time ranges are global and apply to all cats.
de: Die Zeitbereiche sind global und gelten für alle Katzen.

source: If no range is enabled, cats may exit at any time (subject to other settings).
de: Wenn kein Bereich aktiviert ist, können Katzen jederzeit nach draußen gehen (vorbehaltlich anderer Einstellungen).

source: If any range is enabled, cats may exit only during the configured time windows.
de: Wenn ein Bereich aktiviert ist, können Katzen nur während der konfigurierten Zeitfenster nach draußen gehen.

source: Outside these windows, no cat may exit, even if the per‑cat setting in 'Manage Cats' allows exit.
de: Außerhalb dieser Zeitfenster darf keine Katze nach draußen gehen, auch wenn die pro-Katze-Einstellung in 'Katzen verwalten' den Ausgang erlaubt.

source: See the decision logic flowchart above for details.
de: Siehe das Flussdiagramm der Entscheidungslogik oben für Details.

source: Enter times in 24h format HH:MM (e.g., 13:00).
de: Gib die Zeiten im 24-Stunden-Format HH:MM ein (z.B. 13:00).

source: Example: If ranges are 10:00–18:00 and it is 20:00, no cat may exit, even if that cat is allowed per‑cat in 'Manage Cats'.
de: Beispiel: Wenn der erlaubte Bereich von 10:00–18:00 eingestellt ist, und es aktuell 20:00 ist, darf keine Katze nach draußen gehen, auch wenn für diese Katze der Ausgang in 'Katzen verwalten' erlaubt ist.

source: Time range 1
de: Zeitbereich 1

source: From
de: Von

source: To
de: Bis

source: Time range 2
de: Zeitbereich 2

source: Time range 3
de: Zeitbereich 3

source: Reaction speed (in s) of the motion sensor on the inside
de: Reaktionsgeschwindigkeit (in s) des Bewegungssensors auf der Innenseite

source: Explain inside PIR reaction speed
de: Erklärung der Reaktionsgeschwindigkeit des inneren PIR-Sensors

source: A low value means a fast reaction, but also a higher probability of false alarms. A high value means a slow reaction, but also a lower probability of false alarms.
de: Ein niedriger Wert bedeutet eine schnelle Reaktion, aber auch eine höhere Wahrscheinlichkeit von Fehlalarmen. Ein hoher Wert bedeutet eine langsame Reaktion, aber auch eine geringere Wahrscheinlichkeit von Fehlalarmen.

source: The default setting should be a good value for most cases.
de: Die Standardeinstellung sollte für die meisten Fälle ein guter Wert sein.

source: Live view settings
de: Live-Ansicht Einstellungen

source: Update interval for the live camera view in the WebUI.
de: Aktualisierungsintervall für die Live-Kameraansicht in der WebUI.

source: Live-View update interval:
de: Live-Ansicht Aktualisierungsintervall:

source: Refresh the live view every...
de: Aktualisiere die Live-Ansicht alle...

source: NOTE: A high refresh rate could slow down the performance, especially if several users are connected at the same time. Values below 1s require a fast and stable WLAN connection.
de: HINWEIS: Eine hohe Aktualisierungsrate kann die Leistung reduzieren, insbesondere wenn mehrere Benutzer gleichzeitig verbunden sind. Werte unter 1s erfordern eine schnelle und stabile WLAN-Verbindung.

source: This setting affects only the view in the WebUI and has no impact on the detection process.
de: Diese Einstellung betrifft nur die Ansicht in der WebUI und hat keinen Einfluss auf den Erkennungsprozess und die Auswertung der Bilder.

source: Pictures view settings
de: Bilder-Ansicht Einstellungen

source: Configuration of the pictures view in the WebUI, maximum number of pictures in the database and limits of pictures per event.
de: Konfiguration der Bilderansicht in der WebUI, maximale Anzahl an Bildern in der Datenbank und Begrenzungen der Bilder pro Ereignis.

source: Maximum number of photos to retain in the database
de: Maximale Anzahl an Bildern in der Datenbank

source: The oldest pictures will be deleted if the number of pictures exceeds this value.
de: Wenn die Anzahl der Bilder diesen Wert überschreitet, werden die ältesten Bilder gelöscht.

source: The maximum number of pictures depends on the type of the Raspberry Pi, since some kittyflaps are equipped with 16GB and some with 32GB.
de: Die maximale Anzahl an Bildern hängt vom Typ des Raspberry Pi ab, da einige Kittyflaps mit 16GB und einige mit 32GB ausgestattet sind.

source: As a rule of thumb, you can calculate with 200MB per 1000 pictures. You can check the free disk space in the `INFO` section.
de: Als Faustregel kannst du mit 200MB pro 1000 Bildern rechnen. Du kannst den freien Speicherplatz in der `INFO` Sektion überprüfen.

source: Maximal pictures per event with RFID
de: Maximale Anzahl an Bildern pro Ereignis mit RFID

source: Maximal number of pictures that will be stored to the database for a motion event, if a cat with a RFID chip is detected.
de: Maximale Anzahl an Bildern, die für ein Bewegungsereignis in der Datenbank gespeichert werden, wenn eine Katze mit einem RFID-Chip erkannt wird.

source: NOTE: The internal prey detection will still be active for all pictures of this event. This number just limits the number of pictures that will be stored to the database.
de: HINWEIS: Die interne Beuteerkennung bleibt für alle Bilder dieses Ereignisses aktiv. Diese Zahl begrenzt nur die Anzahl der Bilder, die in der Datenbank gespeichert werden.

source: If you set this to 0, no event will be logged to the database. Too many pictures can slow down the performance drastically.
de: Wenn du dies auf 0 setzt, wird kein Ereignis in der Datenbank protokolliert. Zu viele Bilder können die Leistung drastisch verlangsamen.

source: Maximal pictures per event without RFID
de: Maximale Anzahl an Bildern pro Ereignis ohne RFID

source: Maximal number of pictures that will be stored to the database for a motion event, if a motion event without a detected RFID occurs.
de: Maximale Anzahl an Bildern, die für ein Bewegungsereignis in der Datenbank gespeichert werden, wenn ein Bewegungsereignis ohne erkanntes RFID auftritt.

source: Maximum pictures per page
de: Maximale Anzahl an Bildern pro Seite

source: This setting applies only to the `PICTURES` section in the ungrouped view mode.
de: Diese Einstellung gilt nur für die [BILDER] Sektion im ungruppierten Ansichtsmodus.

source: NOTE: Too many pictures per page could slow down the performance drastically!
de: HINWEIS: Zu viele Bilder pro Seite können die Performance drastisch senken!

source: Home Assistant configuration
de: Home Assistant Konfiguration

source: Configure MQTT integration for Home Assistant.
de: MQTT Integration für Home Assistant konfigurieren.

source: Enable MQTT
de: MQTT aktivieren

source: MQTT Broker Address
de: MQTT Broker Adresse

source: e.g. 192.168.1.10
de: z.B. 192.168.1.10

source: MQTT Username
de: MQTT Benutzername

source: MQTT username
de: MQTT Benutzername

source: MQTT Password
de: MQTT Passwort

source: MQTT password
de: MQTT Passwort

source: Camera update interval
de: Kamera Aktualisierungsintervall

source: The interval in seconds between publishing camera images to the MQTT broker.
de: Das Intervall in Sekunden, in dem Kamerabilder an den MQTT Broker übertragen werden.

source: Home Assistant Card Example
de: Beispiel für Home Assistant Dashboard Karte

source: Copy this configuration to create a dashboard card in Home Assistant:
de: Kopiere diese Konfiguration, um eine Dashboard-Karte in Home Assistant zu erstellen:

source: Home Assistant Dashboard Card
de: Home Assistant Dashboard Karte

source: KittyHack Cat Flap
de: KittyHack Katzenklappe

source: Last Event
de: Letztes Ereignis

source: Magnetic Locks
de: Magnetschalter

source: Configuration
de: Konfiguration

source: Open entrance for...
de: Eingangsrichtung öffnen für...

source: Allow cats to exit
de: Ausgang für Katzen erlauben

source: Motion outside
de: Bewegung außen

source: Motion inside
de: Bewegung innen

source: Prey detected
de: Beute erkannt

source: Advanced settings
de: Erweiterte Einstellungen

source: Advanced configuration options for hostname, logging, and performance.
de: Erweiterte Konfigurationsoptionen für Hostname, Logging und Performance.

source: The hostname of the Kittyflap. You can change it to any unique name in your network for an easier access (mDNS / Avahi must be enabled in your router).
de: Der Hostname der Kittyflap. Du kannst ihn in einen eindeutigen Namen in deinem Netzwerk ändern, um einen einfacheren Zugriff zu ermöglichen (mDNS / Avahi muss in deinem Router aktiviert sein).

source: Allowed characters: `a-z`, `A-Z`, `0-9` and `-`.
de: Erlaubte Zeichen: `a-z`, `A-Z`, `0-9` und `-`.

source: NOTE: This setting requires a restart of the kittyflap to take effect.
de: HINWEIS: Diese Einstellung erfordert einen Neustart der Kittyflap.

source: You can access the Kittyflap via the hostname in your browser:
de: Du kannst auf die Kittyflap über den Hostnamen in deinem Browser zugreifen:

source: `INFO` is the default log level and should be used in normal operation. `DEBUG` should only be used if it is really necessary!
de: `INFO` ist das Standard-Log-Level und sollte im normalen Betrieb verwendet werden. `DEBUG` sollte nur verwendet werden, wenn es wirklich notwendig ist!

source: Use all CPU cores for image processing
de: Verwende alle CPU-Kerne für die Bildverarbeitung

source: If this is enabled, all CPU cores will be used for image processing. This results in a faster analysis of the pictures, and therefore a maybe a bit faster prey detection.
de: Wenn diese Einstellung aktiviert ist, werden alle CPU-Kerne für die Bildverarbeitung verwendet. Dies führt zu einer schnelleren Analyse der Bilder und damit zu einer möglicherweise etwas schnelleren Beuteerkennung.

source: **WARNING**: It is NOT recommended to enable this feature! Several users have reported that this option causes reboots or system freezes.
de: **WARNUNG**: Es wird NICHT empfohlen, diese Funktion zu aktivieren! Mehrere Benutzer haben berichtet, dass diese Option zu Neustarts oder Systemabstürzen führt.

source: If you encounter the same issue, it's strongly recommended to disable this setting.
de: Wenn du das gleiche Problem hast, wird dringend empfohlen, diese Einstellung zu deaktivieren.

source: Remote inference FPS limit
de: FPS-Begrenzung für die Inferenz im Remote-Modus

source: Limits the model inference loop to reduce CPU load in remote-mode.
de: Begrenzt die Modell-Inferenzschleife, um die CPU-Auslastung im Remote-Modus zu reduzieren.

source: This setting is only configurable in remote-mode.
de: Diese Einstellung ist nur im Remote-Modus konfigurierbar.

source: Default: 10 FPS
de: Standard: 10 FPS

source: Wait for remote after reboot (seconds)
de: Wartezeit auf Remote nach Neustart (Sekunden)

source: If the Kittyflap has been controlled remotely before, it will wait this long for a remote-control takeover after reboot before starting Kittyhack locally.
de: Wenn die Kittyflap zuvor remote gesteuert wurde, wartet sie nach einem Neustart so lange auf eine Übernahme der Fernsteuerung, bevor Kittyhack lokal gestartet wird.

source: IP camera watchdog
de: IP Kamera Watchdog

source: If enabled, the stream of an external camera will be automatically restarted if corrupted frames are detected.
de: Wenn aktiviert, wird der Stream einer externen Kamera automatisch neu gestartet, wenn beschädigte Frames erkannt werden.

source: WLAN watchdog is not available in remote-mode.
de: Der WLAN Watchdog ist im Remote-Modus nicht verfügbar.

source: If enabled, the WLAN connection will be monitored and automatically reconnected on failure. If this also fails, the Kittyflap will automatically restart.
de: Wenn aktiviert, wird die WLAN-Verbindung überwacht und bei einem Ausfall automatisch wiederhergestellt. Wenn dies ebenfalls fehlschlägt, wird die Kittyflap automatisch neu gestartet.

source: Disable RFID reader
de: RFID-Leser deaktivieren

source: If this option is enabled, the RFID reader will NOT be powered when motion is detected. Use only for troubleshooting hardware defects or undervoltage reboots. You must rely on 'Open inside direction for: All cats' or camera-based cat detection instead.
de: Wenn diese Option aktiviert ist, wird der RFID-Leser NICHT mit Strom versorgt, wenn eine Bewegung erkannt wird. Verwende dies nur zur Fehlerbehebung bei Hardwaredefekten wie Neustarts wegen Undervoltage. Du musst stattdessen auf 'Eingangsrichtung öffnen für: Alle Katzen' oder kamera-basierte Katzenerkennung wechseln, damit deine Katzen hereinkommen können.

source: Default: Disabled
de: Standard: Deaktiviert

source: Remote-mode guide
de: Anleitung für den Remote-Modus

source: Shows the remote-mode documentation.
de: Zeigt die Dokumentation für den Remote-Modus an.

source: Allowed to exit time ranges:
de: Erlaubte Ausgangs-Zeitbereiche:

source: Invalid time format. Please use HH:MM format.
de: Ungültiges Zeitformat. Bitte gib die Zeit im Format HH:MM an.

source: Changes were not saved.
de: Änderungen wurden nicht gespeichert.

source: Time must be between 00:00 and 23:59.
de: Die Zeit muss zwischen 00:00 und 23:59 liegen.

source: Invalid time value.
de: Ungültige Zeitangabe.

source: Invalid hostname. Only letters, numbers and hyphens are allowed.
de: Ungültiger Hostname. Nur Buchstaben, Zahlen und Bindestriche sind erlaubt.

source: IP Camera URL:
de: IP Kamera URL:

source: Invalid stream URL format. Please use a valid URL starting with rtsp://, http://, https://, rtmp://, udp://, tcp://, or file://
de: Ungültiges Stream-URL-Format. Bitte verwende eine gültige URL, die mit rtsp://, http://, https://, rtmp://, udp://, tcp:// oder file:// beginnt.

source: FFmpeg is required for the decode+scale pipeline but could not be installed automatically.
de: FFmpeg wird für die Decode+Scale Pipeline benötigt, konnte aber nicht automatisch installiert werden.

source: Please install `ffmpeg` manually and try again. Changes were not saved.
de: Bitte installiere `ffmpeg` manuell und versuche es erneut. Änderungen wurden nicht gespeichert.

source: Invalid configuration:
de: Ungültige Konfiguration:

source: You cannot use the camera for motion detection in combination with an original Kittyflap model. You need a custom trained model for this.
de: Du kannst die Kamera nicht für die Bewegungserkennung in Kombination mit einem originalen Kittyflap Modell verwenden. Du benötigst dafür ein benutzerdefiniertes trainiertes Modell.

source: The setting "{}" was disabled.
de: Die Einstellung "{}" wurde deaktiviert.

source: You cannot use the camera for cat detection in combination with an original Kittyflap model. You need a custom trained model for this.
de: Du kannst die Kamera nicht für die Katzenerkennung in Kombination mit einem originalen Kittyflap Modell verwenden. Du benötigst dafür ein benutzerdefiniertes trainiertes Modell.

source: Kittyhack configuration updated successfully.
de: Kittyhack Konfiguration erfolgreich aktualisiert.

source: Model change applied.
de: Modelländerung angewendet.

source: Model change could not be applied live. A reboot is still required.
de: Modelländerung konnte nicht live angewendet werden. Ein Neustart ist erforderlich.

source: Please restart the kittyflap in the [SYSTEM] section, to apply the new language.
de: Bitte starte die Kittyflap in der [SYSTEM] Sektion neu, um die neue Sprache anzuwenden.

source: A restart is required to apply the changes. Do you want to reboot the kittyflap now?
de: Ein Neustart ist erforderlich, um die Änderungen anzuwenden. Möchtest du die Kittyflap jetzt neu starten?

source: Reboot
de: Neustart

source: Failed to restart MQTT client. Check the logs for details.
de: Fehler beim Neustarten des MQTT Clients. Überprüfe die Logs für Details.

source: Failed to save the Kittyhack configuration.
de: Kittyhack Konfiguration konnte nicht gespeichert werden.

source: Configured WLANs
de: Konfigurierte WLANs

source: Add new WLAN
de: Neues WLAN hinzufügen

source: Connected
de: Verbunden

source: Not connected
de: Nicht verbunden

source: Enforce connection to this WLAN
de: Verbindung zu diesem WLAN erzwingen

source: Modify this WLAN
de: Dieses WLAN ändern

source: Failed to scan for available WLANs
de: Fehler beim scannen nach verfügbaren WLANs

source: Available WLANs
de: Verfügbare WLANs

source: No signal
de: Kein Signal

source: Weak signal
de: Schwaches Signal

source: Medium signal
de: Ausreichendes Signal

source: Strong signal
de: Starkes Signal

source: Channel
de: Kanal

source: Creating log archive. Please wait...
de: Erstelle Log-Archiv. Bitte warten...

source: Preparing Download
de: Bereite Download vor

source: Failed to create logs zip file: {}
de: Fehler beim erstellen der Log-Datei: {}

source: Database snapshot is unavailable during image migration ({} pictures remaining). Please try again later.
de: Die Datenbanksicherung ist während der Datenbankmigration nicht verfügbar ({} verbleibende Bilder). Bitte versuche es später erneut.

source: Failed to create a consistent snapshot: {}
de: Fehler beim erstellen eines Backups: {}
