Repository: floppyFK/kittyhack
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: Failed to update cat details: {}
de: Feher beim aktualisieren der Katzen-Details: {}

source: No changes detected. Nothing to save.
de: Keine Änderungen erkannt. Nichts zu speichern.

source: **Important:** Please read the notes about the prerequisites for the individual entry/exit configuration in the `MANAGE CATS` section if you want to use these features.
de: **Wichtig:** Bitte lies die Hinweise zu den Voraussetzungen für die individuelle Ein-/Ausgangskonfiguration in der `KATZEN VERWALTEN` Sektion, wenn du diese Funktionen nutzen möchtest.

source: Add new cat
de: Neue Katze hinzufügen

source: You can find the RFID in the [PICTURES] section, if the chip of your cat was recognized by the Kittyflap. To read the RFID, just set the entrance mode to 'All Cats' and let pass your cat through the Kittyflap.
de: Du findest die RFID in der [BILDER] Sektion, wenn der Chip deiner Katze von der Kittyflap erkannt wurde. Um die RFID zu lesen, stelle einfach den Eingangsmodus auf 'Alle Katzen' und lasse deine Katze durch die Kittyflap gehen.

source: Upload Picture
de: Bild hochladen

source: New cat {} added successfully.
de: Neue Katze {} erfolgreich hinzugefügt.

source: An error occurred while adding the new cat: {}
de: Beim Hinzufügen der neuen Katze trat ein Fehler auf: {}

source: unknown
de: Unbekannt

source: Stop Label Studio
de: Stoppe Label Studio

source: Label Studio is running. Click the button to stop it.
de: Label Studio läuft. Klicke auf den Button, um es zu stoppen.

source: Remember to stop Label Studio after you are done with the labeling process, to free up resources for KittyHack.
de: Denke daran, Label Studio zu stoppen, nachdem du mit dem Labeling-Prozess fertig bist, um Ressourcen für KittyHack freizugeben.

source: Open Label Studio
de: Label Studio öffnen

source: Installed Version:
de: Installierte Version:

source: Latest version:
de: Neueste Version:

source: Start Label Studio
de: Label Studio starten

source: Label Studio is not running. Click the button to start it.
de: Label Studio läuft nicht. Klicke auf den Button, um es zu starten.

source: Update Label Studio
de: Label Studio aktualisieren

source: Click the button to update Label Studio to the latest version.
de: Klicke auf den Button, um Label Studio auf die neueste Version zu aktualisieren.

source: Current Version
de: Aktuelle Version

source: Latest Version
de: Neueste Version

source: Remove Label Studio
de: Label Studio entfernen

source: Click the button to remove Label Studio.
de: Klicke auf den Button, um Label Studio zu entfernen.

source: (Your project data will not be deleted. You can re-install Label Studio later.)
de: (Deine Projektdaten werden nicht gelöscht. Du kannst Label Studio später wieder installieren.)

source: #### You have two choices:
de: #### Du hast zwei Möglichkeiten:

source: 1. `EASY` **Install Label Studio automatically on the Kittyflap**:
de: 1. `EINFACH` **Label Studio automatisch auf der Kittyflap installieren**:

source: Easy, but you may be limited in the number of images you can label. The performance may vary, depending on the wlan connection to the Kittyflap.
de: Einfach, aber du bist möglicherweise in der Anzahl der Bilder, die du labeln kannst, eingeschränkt. Die Leistung kann je nach WLAN-Verbindung zur Kittyflap variieren.

source: 2. `EXPERT` **Install Label Studio on your own computer**:
de: 2. `EXPERT` **Label Studio auf deinem eigenen Computer installieren**:

source: This is a bit harder, but you are more flexible and the performance while labeling the images may be better. Also, you don't need to worry about the limited disk space on the Kittyflap. See the [Label Studio](https://labelstud.io/) website for instructions.
de: Das ist etwas schwieriger, aber du bist flexibler und die Leistung beim Labeln der Bilder kann besser sein. Außerdem musst du dir keine Gedanken über den begrenzten Speicherplatz auf der Kittyflap machen. Siehe die Website [Label Studio](https://labelstud.io/) für Anweisungen.

source: > **Please note, if you want to install Label Studio on the Kittyflap:**
de: > **Bitte beachten, wenn du Label Studio auf der Kittyflap installieren möchtest:**

source: Some Kittyflaps have only 1GB of RAM. In this case, it is strongly recommended to always stop the Label Studio server after you are done with the labeling process, otherwise the Kittyflap may run out of memory.
de: Einige Kittyflaps sind nur mit 1GB RAM ausgestattet. In diesem Fall wird dringend empfohlen, den Label Studio Server immer zu stoppen, nachdem du mit dem Labeling-Prozess fertig bist, da sonst der Kittyflap der Speicher ausgehen könnte.

source: You can check the available disk space and the RAM configuration in the `INFO` section.
de: Du kannst den verfügbaren Speicherplatz und die RAM-Konfiguration in der `INFO` Sektion überprüfen.

source: Install Label Studio on the Kittyflap
de: Label Studio auf der Kittyflap installieren

source: Click the button to install Label Studio.
de: Klicke auf den Button, um Label Studio zu installieren.

source: This will take 5-10 minutes, so please be patient.
de: Dies wird 5-10 Minuten dauern, also bitte geduldig sein.

source: The Kittyflap may not be reachable during the installation. This is normal.
de: Die Kittyflap ist während der Installation möglicherweise nicht erreichbar. Das ist normal.

source: A model training is currently in progress.
de: Ein Modelltraining läuft derzeit.

source: You will be notified by email when the training is finished.
de: Du wirst per E-Mail benachrichtigt, wenn das Training abgeschlossen ist.

source: Current status: {}
de: Aktueller Status: {}

source: Reload Model Training Status
de: Modell-Trainingsstatus aktualisieren

source: Your individual Training ID:
de: Deine individuelle Trainings-ID:

source: (use this ID for support requests)
de: (verwende diese ID für Support-Anfragen)

source: Cancel Model Training
de: Modelltraining abbrechen

source: Unable to reach the model training server right now. Please check your network or try again later.
de: Der Modell-Trainingsserver ist derzeit nicht erreichbar. Bitte überprüfe dein Netzwerk oder versuche es später erneut.

source: If the issue persists, the server may be temporarily unavailable.
de: Wenn das Problem weiterhin besteht, ist der Server möglicherweise vorübergehend nicht verfügbar.

source: The model training server is currently in maintenance. Please try again later.
de: Der Modell-Trainingsserver befindet sich derzeit im Wartungsmodus. Bitte versuche es später erneut.

source: YOLOv8 model
de: YOLOv8 Modell

source: Image size
de: Bildgröße

source: Upload Label-Studio Training Data (ZIP file)
de: Label-Studio Trainingsdaten hochladen (ZIP-Datei)

source: Model Name (optional)
de: Modellname (optional)

source: Enter a name for your model
de: Gib deinem Modell einen Namen

source: Username (optional)
de: Benutzername (optional)

source: Enter your name
de: Gib deinen Namen ein

source: Email for Notification (optional)
de: E-Mail für Benachrichtigung (optional)

source: Enter your email address
de: Gib deine E-Mail-Adresse ein

source: If you provide an email address, you will be notified when the model training is finished.
de: Wenn du eine E-Mail-Adresse angibst, wirst du benachrichtigt, wenn das Modelltraining abgeschlossen ist.

source: Advanced options
de: Erweiterte Optionen

source: Base model (YOLOv8n/s/m/l/x): larger variants are usually more accurate, but they run slower and need more CPU/RAM. Choose smaller variants (e.g. 'n') if your device struggles to keep up in real-time.
de: Basis-Modell (YOLOv8n/s/m/l/x): Größere Varianten sind in der Regel genauer, laufen aber langsamer und benötigen mehr CPU/RAM. Wähle kleinere Varianten (z.B. 'n'), wenn dein Gerät Schwierigkeiten hat, in Echtzeit Schritt zu halten.

source: Image size (imgsz): higher values can improve detection of small objects, but increase computation and can reduce FPS.
de: Bildgröße (imgsz): Höhere Werte können die Erkennung von kleinen Objekten verbessern, erhöhen aber die Rechenzeit und können die FPS reduzieren.

source: These options are only available if you run Kittyhack on a dedicated system in remote mode.
de: Diese Optionen sind nur verfügbar, wenn du Kittyhack auf einem dedizierten System im Remote-Modus betreibst.

source: Defaults: YOLOv8n and image size 320.
de: Standard: YOLOv8n und Bildgröße 320.

source: Submit Model for Training
de: Modell zum Training abschicken

source: Description
de: Beschreibung

source: In this section, you can train your own individual AI model for the Kittyflap. The training process consists of two steps:
de: In diesem Abschnitt kannst du dein eigenes individuelles KI-Modell für die Kittyflap trainieren. Der Trainingsprozess besteht aus zwei Schritten:

source: 1. **Label Studio**: In this step, you can label your cat(s) and their prey in the captured images. This is done using the Label Studio tool.
de: 1. **Label Studio**: In diesem Schritt kannst du deine Katze(n) und ihre Beute in den aufgenommenen Bildern labeln. Dies geschieht mit dem Label Studio Tool.

source: 2. **Model Training**: In this step, the labeled images are used to train a new AI model.
de: 2. **Modelltraining**: In diesem Schritt werden die gelabelten Bilder verwendet, um ein neues KI-Modell zu trainieren.

source: To achieve the best results, it is recommended to label at least 100 images of each cat and their prey. The more images you label, the better the model will be.
de: Um die besten Ergebnisse zu erzielen, wird empfohlen, mindestens 100 Bilder von jeder Katze und ihrer Beute zu labeln. Je mehr Bilder du labelst, desto besser wird das Modell.

source: The training process can take from several minutes up to an hour, depending on the number of images.
de: Der Trainingsprozess kann je nach Anzahl der Bilder von mehreren Minuten bis zu einer Stunde dauern.

source: Please read the instructions before creating your own model! Following these exact instructions is crucial for successful training:
de: Bitte lies die Anweisungen, bevor du dein eigenes Modell erstellst! Sie sind entscheidend für den Erfolg des Trainings:

source: Instructions for training your own model
de: Anweisungen zum Trainieren deines eigenen Modells

source: Model Training
de: Modelltraining

source: Model Management
de: Modellverwaltung

source: Here you can rename or remove your own models. To activate a model, go to the [CONFIGURATION] section.
de: Hier kannst du deine eigenen Modelle umbenennen oder entfernen. Um ein Modell zu aktivieren, gehe zur Sektion [KONFIGURATION].

source: Nothing here yet. Please train a model first.
de: Hier ist noch nichts. Bitte trainiere zuerst ein Modell.

source: YOLO v8 model
de: YOLO v8 Modell

source: Model image size: {}px
de: Modellbildgröße: {}px

source: Average FPS with this model
de: Durchschnittliche FPS mit diesem Modell

source: Active
de: Aktiv

source: Currently active model
de: Derzeit aktives Modell

source: Use this model now
de: Dieses Modell jetzt verwenden

source: Modify or delete this model
de: Dieses Modell ändern oder löschen

source: No model training in progress.
de: Kein Modelltraining in Bearbeitung.

source: Do you really want to cancel the model training?
de: Möchtest du das Modelltraining wirklich abbrechen?

source: Model training cancelled.
de: Modelltraining abgebrochen.

source: Please upload a ZIP file with the Label Studio training data.
de: Bitte lade eine ZIP-Datei mit den Label Studio Trainingsdaten hoch.

source: The uploaded file is not a ZIP file. Please upload a valid ZIP file.
de: Die hochgeladene Datei ist keine ZIP-Datei. Bitte lade eine gültige ZIP-Datei hoch.

source: Invalid YOLOv8 model selection.
de: Ungültige YOLOv8 Modellauswahl.

source: Invalid image size selection.
de: Ungültige Bildgrößenauswahl.

source: Please enter a valid email address.
de: Bitte gib eine gültige E-Mail-Adresse ein.

source: The uploaded file is not a valid Label Studio training data ZIP file.
de: Die hochgeladene Datei ist keine gültige Label Studio Trainingsdaten ZIP-Datei.

source: The destination for the model training is unreachable. Please check your network connection or try again later.
de: Der Server für das Modelltraining ist nicht erreichbar. Bitte überprüfe deine Netzwerkverbindung oder versuche es später erneut.

source: An error occurred while starting the model training: {}
de: Bei dem Start des Modelltrainings ist ein Fehler aufgetreten: {}

source: Insufficient disk space. At least 1.5GB of free space is required to install Label Studio. Please free up some space and try again.
de: Nicht genügend Speicherplatz. Mindestens 1,5 GB freier Speicherplatz sind erforderlich, um Label Studio zu installieren. Bitte gib etwas Speicherplatz frei und versuche es erneut.

source: Label Studio installed successfully! You can start it now.
de: Label Studio erfolgreich installiert! Du kannst es jetzt starten.

source: Label Studio installation failed. Please check the logs for details.
de: Ein Fehler ist während des Installationsprozesses aufgetreten. Bitte überprüfe die Logs für Details.

source: Label Studio updated successfully! You can start it now.
de: Label Studio erfolgreich aktualisiert! Du kannst es jetzt starten.

source: Label Studio update failed. Please check the logs for details.
de: Beim Updaten von Label Studio ist ein Fehler aufgetreten. Bitte überprüfe die Logs für Details.

source: Removing Label Studio
de: Lösche Label Studio

source: Label Studio removed successfully.
de: Label Studio erfolgreich entfernt.

source: Label Studio removal failed. Please check the logs for details.
de: Label Studio konnte nicht entfernt werden. Bitte überprüfe die Logs für Details.

source: Stopping Label Studio...
de: Label Studio wird gestoppt...

source: Label Studio stopped successfully.
de: Label Studio erfolgreich gestoppt.

source: Label Studio may not have stopped completely. Please check the logs.
de: Label Studio wurde möglicherweise nicht vollständig gestoppt. Bitte überprüfe die Logs.

source: Starting Label Studio...
de: Label Studio wird gestartet...

source: (The first start of Label Studio may take several minutes!)
de: (Der erste Start von Label Studio kann mehrere Minuten dauern!)

source: Label Studio started successfully.
de: Label Studio erfolgreich gestartet.

source: Label Studio may not have started completely. Please check the logs.
de: Label Studio wurde möglicherweise nicht vollständig gestartet. Bitte überprüfe die Logs.

source: The remote-mode documentation could not be loaded.
de: Die Remote-Modus-Dokumentation konnte nicht geladen werden.

source: General settings
de: Allgemeine Einstellungen

source: Basic language, timezone, and display options for Kittyhack.
de: Grundlegende Sprache, Zeitzone und Anzeigeoptionen für Kittyhack.

source: Language
de: Sprache

source: Timezone
de: Zeitzone

source: See
de: Siehe

source: for valid timezone strings
de: für gültige Zeitzonen Strings

source: Date format
de: Datumsformat

source: Valid placeholders: `yyyy`, `mm`, `dd`
de: Gültige Platzhalter: `yyyy`, `mm`, `dd`

source: Example:
de: Beispiel:

source: for
de: für

source: Periodic version check
de: Nach updates suchen

source: Automatically check for new versions of Kittyhack.
de: Automatisch nach neuen Versionen von Kittyhack suchen.

source: WLAN settings are not available in remote-mode.
de: WLAN-Einstellungen sind im Remote-Modus nicht verfügbar.

source: WLAN TX power (in dBm)
de: WLAN Sendeleistung (in dBm)

source: WARNING: You should keep the TX power as low as possible to avoid interference with the PIR Sensors! You should only increase this value, if you have problems with the WLAN connection.
de: ACHTUNG: Du solltest die Sendeleistung so niedrig wie möglich halten, um Interferenzen mit den PIR-Sensoren zu vermeiden! Du solltest diesen Wert nur erhöhen, wenn du Probleme mit der WLAN-Verbindung hast.

source: Default value: {}
de: Standardwert: {}

source: Camera settings
de: Kameraeinstellungen

source: Camera specific settings for the internal and external cameras.
de: Kameraspezifische Einstellungen für die interne und externe Kamera.

source: Show IP camera usage tips
de: Tipps zur Verwendung von IP-Kameras anzeigen

source: You can use an **external IP camera** instead of the internal camera to achieve better viewing angles and better night vision. **Important notes:** - Both Kittyflap and the IP camera need a stable WLAN (Ethernet recommended for camera). - Use a **static IP** for the camera. - Ensure a compatible stream (RTSP / HTTP MJPEG / RTMP / UDP / TCP). - Recommended max resolution 1280x720 @ ≤15fps (higher reduces performance). - Configure resolution in camera settings or use alternate stream URLs. If you experience interruptions, check WLAN signal and network configuration.
de: Du kannst eine **externe IP-Kamera** anstelle der internen Kamera verwenden, um bessere Blickwinkel und bessere Nachtsicht zu erzielen. **Wichtige Hinweise:** - Sowohl die Kittyflap als auch die IP-Kamera benötigen ein stabiles WLAN (Ethernet für Kamera empfohlen). - Verwende eine **statische IP** für die Kamera. - Stelle einen kompatiblen Stream sicher (RTSP / HTTP MJPEG / RTMP / UDP / TCP). - Empfohlene maximale Auflösung 1280x720 @ ≤15fps (höhere Auflösungen reduzieren die Leistung drastisch). - Konfiguriere die Auflösung in den Kameraeinstellungen oder verwende alternative Stream-URLs. Wenn du Unterbrechungen feststellst, überprüfe das WLAN-Signal und die Netzwerkkonfiguration.

source: Camera source
de: Kameraquelle

source: Internal Camera
de: Interne Kamera

source: External IP Camera
de: Externe IP Kamera

source: External IP Camera URL
de: URL der externen IP Kamera

source: e.g. rtsp://user:pass@192.168.1.100:554/stream
de: z.B. rtsp://user:pass@192.168.1.100:554/stream

source: Show stream URL examples
de: Beispiele für Stream-URLs anzeigen

source: **Examples of supported stream URLs:**
de: **Beispiele für unterstützte Stream-URLs:**

source: Advanced IP camera settings
de: Erweiterte IP-Kamera-Einstellungen

source: Downscale IP camera stream
de: IP-Kamera-Stream herunterskalieren

source: If enabled, the IP camera stream is downscaled before frames reach Kittyhack.
de: Wenn aktiviert, wird der IP-Kamera-Stream herunterskaliert, bevor die Bilder Kittyhack erreichen.

source: This can reduce CPU load and improve inference FPS for high-resolution streams.
de: Dies kann die CPU-Auslastung reduzieren und die Inferenz-FPS für hochauflösende Streams verbessern.

source: Target resolution for IP camera stream
de: Zielauflösung für den IP-Kamera-Stream

source: Recommendation: choose `640x360` or `1280x720` for best performance/quality tradeoff.
de: Empfehlung: Wähle `640x360` oder `1280x720` für das beste Verhältnis von Leistung und Qualität.

source: IP camera FPS limit
de: FPS-Limit für IP-Kamera

source: Unlimited
de: Unbegrenzt

source: Default is `10 FPS`. Set to `Unlimited` to disable FPS limiting in the downscale pipeline (may cause higher CPU load).
de: Standard ist `10 FPS`. Setze auf `Unbegrenzt`, um die FPS-Begrenzung beim Herunterskalieren zu deaktivieren (kann zu höherer CPU-Auslastung führen).

source: Door control settings
de: Einstellungen für die Klappensteuerung

source: Detection thresholds, model selection and other settings for the door control.
de: Erkennungsschwellenwerte, Modellauswahl und andere Einstellungen für die Klappensteuerung.

source: Minimum detection threshold
de: Minimale Erkennungsschwelle

source: Explain minimum detection threshold
de: Erklärung für die Minimale Erkennungsschwelle

source: Used to decide if an outside motion event is logged. At least one picture must exceed this probability or the event is discarded. *(Default value: {})*
de: Wird verwendet, um zu entscheiden, ob ein Bewegungsereignis auf der Außenseite protokolliert werden soll oder nicht. Mindestens ein Bild muss diese Wahrscheinlichkeit überschreiten, sonst wird das Ereignis verworfen. *(Standardwert: {})*

source: Mouse detection threshold
de: Schwellwert für die Mauserkennung

source: Explain mouse threshold
de: Erklärung für den Mausschwellwert

source: Kittyhack decides if a picture contains a mouse based on this value. If probability exceeds it, flap stays closed. *(Default value: {})* **Note:** Minimum is coupled to 'Minimum detection threshold'.
de: Kittyhack entscheidet basierend auf diesem Wert, ob ein Bild eine Maus enthält. Wenn die Wahrscheinlichkeit diesen Wert überschreitet, bleibt die Klappe geschlossen. *(Standardwert: {})* **Hinweis:** Das Minimum ist an die 'Minimale Erkennungsschwelle' gekoppelt.

source: Cat detection threshold
de: Schwellwert für Katzenerkennung

source: Explain cat threshold
de: Erklärung für den Katzenschwellwert

source: Kittyhack decides based on this value, if a picture contains your cat.
de: Kittyhack entscheidet basierend auf diesem Wert, ob ein Bild deine Katze enthält.

source: If the detected probability of your cat exceeds this value in a picture, and the setting `Use camera for cat detection` is enabled, the flap will be opened.
de: Wenn die erkannte Wahrscheinlichkeit deiner Katze in einem Bild diesen Wert überschreitet und die Einstellung `Kamera für Katzenerkennung verwenden` aktiviert ist, wird die Klappe geöffnet.

source: Note: The minimum of this value is always coupled to the configured value of 'Minimum detection threshold' above.
de: Hinweis: Das Minimum dieses Wertes ist immer an den konfigurierten Wert der 'Minimale Erkennungsschwelle' oben gekoppelt.

source: Seconds before unlock decision
de: Sekunden vor der Entscheidung zur Freigabe

source: Explain unlock decision delay
de: Erklärung der Verzögerung der Freigabeentscheidung

source: Time in seconds after an outside motion trigger before Kittyhack may unlock.
de: Zeit in Sekunden nach einem Bewegungsereignis auf der Außenseite, bevor Kittyhack die Klappe freigeben darf.

source: Unlock is only possible if no prey was detected during this initial analysis window.
de: Die Freigabe ist nur möglich, wenn während dieses anfänglichen Analysefensters keine Beute erkannt wurde.

source: After unlocking: If a later picture reaches the mouse_threshold, the flap is locked again.
de: Nach der Freigabe: Wenn ein späteres Bild den Mausschwellwert erreicht,wird die Klappe wieder verriegelt.

source: Lock duration after prey detection (in s)
de: Verriegelungsdauer nach Beuteerkennung (in s)

source: Explain lock duration
de: Erklärung der Verriegelungsdauer

source: The flap will remain closed for this time after a prey detection.
de: Die Klappe bleibt nach einer Beuteerkennung für diese Zeit geschlossen.

source: Detect prey
de: Beuteerkennung

source: Explain prey detection
de: Erklärung der Beuteerkennung

source: If the prey detection is enabled and the mouse detection threshold is exceeded in a picture, the flap will remain closed. **NOTE:** This is the global setting. It can also be configured per cat in the `MANAGE CATS` section.
de: Wenn die Beuteerkennung aktiviert ist und der Mauserkennungs-Schwellwert in einem Bild überschritten wird, bleibt die Klappe geschlossen. **HINWEIS:** Dies ist die globale Einstellung. Sie kann auch pro Katze im Abschnitt `KATZEN VERWALTEN` konfiguriert werden.

source: Version of the object detection model
de: Version des Objekterkennungsmodells

source: Show model version explanation
de: Erklärung der Modellversion anzeigen

source: Original Kittyflap Model v1:
de: Original Kittyflap Modell v1:

source: Always tries to detect objects `Mouse` and `No Mouse`, even if there is no such object in the picture.
de: Versucht immer, die Objekte `Maus` und `Keine Maus` zu erkennen, auch wenn kein solches Objekt im Bild ist.

source: Original Kittyflap Model v2:
de: Original Kittyflap Modell v2:
