Repository: floppyFK/kittyhack
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: The kittyflap was not shut down gracefully several times in a row. Please do not power off the device without shutting it down first, otherwise the database may be corrupted!
de: Die Kittyflap wurde mehrmals hintereinander nicht ordnungsgemäß heruntergefahren. Bitte stecke sie nicht aus, ohne sie vorher herunterzufahren, da sonst die Datenbank beschädigt werden könnte!

source: If you have shut it down gracefully and see this message, please report it in the
de: Wenn du sie ordnungsgemäß heruntergefahren hast und diese Meldung siehst, melde dies bitte im

source: thanks!
de: danke!

source: > **NOTE:** The option `Use all CPU cores for image processing` has been disabled now automatically, since this could cause the issue on some devices.
de: > **HINWEIS:** Die Option `Alle CPU-Kerne für die Bildverarbeitung` wurde jetzt automatisch deaktiviert, da dies das Problem auf einigen Geräten verursachen könnte.

source: Please check the settings and enable it again, if you want to use it.
de: Bitte überprüfe die Einstellungen und aktiviere sie wieder, wenn du sie wieder verwenden möchtest.

source: Several crashes detected!
de: Mehrere Abstürze erkannt!

source: Model fallback applied
de: Modell-Fallback angewendet

source: The configured YOLO model was not found at startup:
de: Das konfigurierte YOLO-Modell wurde beim Start nicht gefunden:

source: Kittyhack switched automatically to another available YOLO model:
de: Kittyhack hat automatisch zu einem anderen verfügbaren YOLO-Modell gewechselt:

source: No other YOLO model was available. Kittyhack switched to the shipped TFLite model:
de: Kein anderes YOLO-Modell war verfügbar. Kittyhack hat zum mitgelieferten TFLite-Modell gewechselt:

source: Database restored
de: Datenbank wiederhergestellt

source: The kittyhack database was corrupted at startup and has been restored from backup: {}. The corrupted file was archived as: {}
de: Die Kittyhack-Datenbank war beim Start beschädigt und wurde aus dem Backup: {} wiederhergestellt. Die beschädigte Datei wurde als: {} archiviert

source: Pause playback to download the current picture
de: Wiedergabe pausieren, um das aktuelle Bild herunterzuladen

source: Download current picture
de: Aktuelles Bild herunterladen

source: Loading...
de: Wird geladen...

source: Delete all pictures of this event
de: Alle Bilder von diesem Ereignis löschen

source: Toggle overlay for detected objects
de: Overlay für erkannte Objekte ein-/ausschalten

source: Download all pictures of this event (ZIP)
de: Alle Bilder von diesem Ereignis herunterladen (ZIP)

source: No pictures found for this event.
de: Keine Bilder für dieses Ereignis gefunden.

source: An error occured while reading the image.
de: Fehler beim lesen des Bildes.

source: Pause playback before downloading the current picture.
de: Wiedergabe vor dem Herunterladen des aktuellen Bildes pausieren.

source: The WLAN connection will be interrupted now!
de: Die WLAN-Verbindung wird jetzt unterbrochen!

source: Please wait a few seconds. If the page does not reload automatically within 30 seconds, please reload it manually.
de: Bitte warte ein paar Sekunden. Wenn die Seite nicht innerhalb von 30 Sekunden automatisch neu lädt, lade sie bitte manuell neu.

source: Updating WLAN configuration...
de: WLAN-Konfiguration wird aktualisiert...

source: This WLAN is currently connected. You can not delete it or change the password.
de: Dieses WLAN ist derzeit verbunden. Du kannst es nicht löschen oder das Passwort ändern.

source: Password
de: Passwort

source: Leave empty to keep the current password
de: Leer lassen, um akt. Passwort zu behalten

source: Priority
de: Priorität

source: The priority determines the order in which the WLANs are tried to connect. Higher numbers are tried first.
de: Die Priorität bestimmt die Reihenfolge, in der versucht wird, eine Verbindung zu den WLANs herzustellen. Höhere Werte werden zuerst versucht.

source: Change WLAN configuration
de: WLAN-Konfiguration ändern

source: Save
de: Speichern

source: Cancel
de: Abbrechen

source: Delete
de: Löschen

source: WLAN configuration for {} updated successfully.
de: WLAN-Konfiguration für {} erfolgreich aktualisiert.

source: Failed to update WLAN configuration for {}
de: Fehler beim aktualisieren der WLAN-Konfiguration für {}

source: WLAN connection {} deleted successfully.
de: WLAN-Verbindung {} erfolgreich gelöscht.

source: Failed to delete WLAN connection {}
de: Fehler beim löschen der WLAN-Verbindung {}

source: This model is currently in use. You can not delete it.
de: Dieses Modell wird derzeit verwendet. Du kannst es nicht löschen.

source: Unique ID
de: Eindeutige ID

source: Model created at: {}
de: Modell erstellt am: {}

source: Change model configuration
de: Modell-Konfiguration ändern

source: Model configuration {} updated successfully.
de: Modell-Konfiguration {} erfolgreich aktualisiert.

source: Failed to update model configuration {}
de: Fehler beim aktualisieren der Modell-Konfiguration {}

source: Do you really want to delete this model?
de: Möchtest du dieses Modell wirklich löschen?

source: Delete Model
de: Modell Löschen

source: Model {} deleted successfully.
de: Modell {} erfolgreich gelöscht.

source: Failed to delete Model {}
de: Fehler beim löschen des Modells {}

source: This model cannot be selected because it has no unique ID.
de: Dieses Modell kann nicht ausgewählt werden, da es keine eindeutige ID hat.

source: This model is already active.
de: Dieses Modell ist bereits aktiv.

source: Model switched successfully.
de: Modell erfolgreich gewechselt.

source: Model was selected, but live reload failed. Please reboot to apply the change.
de: Modell wurde ausgewählt, aber Live-Reload ist fehlgeschlagen. Bitte starte neu, um die Änderung anzuwenden.

source: Warning
de: Warnung

source: Your IP camera resolution is higher than recommended (max. 1280x720).
de: Die Auflösung deiner IP-Kamera ist höher als empfohlen (max. 1280x720).

source: Current: {width}x{height}. This may have negative effects on performance.
de: Aktuell: {width}x{height}. Dies kann negative Auswirkungen auf die Leistung haben.

source: Notifications
de: Benachrichtigungen

source: Close
de: Schließen

source: Remote target host not configured
de: Remote-Zielhost nicht konfiguriert

source: Remote: not configured
de: Remote: nicht konfiguriert

source: Connected to Kittyflap
de: Kittyflap verbunden

source: Remote: connected
de: Remote: verbunden

source: Disconnect
de: Trennen

source: Disconnected from Kittyflap
de: Von Kittyflap getrennt

source: Remote: disconnected
de: Remote: getrennt

source: Connecting to Kittyflap
de: Kittyflap wird verbunden

source: Remote: connecting
de: Remote: wird verbunden

source: Remote-mode setup is required before Kittyhack can start.
de: Die Einrichtung des Remote-Modus ist erforderlich, bevor Kittyhack gestartet werden kann.

source: After saving, an initial sync can take several minutes (depending on pictures/models size).
de: Nach dem Speichern kann eine erste Synchronisierung mehrere Minuten dauern (abhängig von der Größe der Bilder/Modelle).

source: Please keep this browser tab open and do not close or reload it until synchronization is finished.
de: Bitte halte diesen Browser-Tab offen und schließe oder lade ihn nicht neu, bis die Synchronisierung abgeschlossen ist.

source: Startup continues after a successful sync and service restart.
de: Der Startvorgang wird nach einer erfolgreichen Synchronisierung und einem Neustart des Dienstes fortgesetzt.

source: Remote target host IP:
de: Remote-Zielhost IP:

source: Sync on first connect
de: Synchronisierung beim ersten Verbinden

source: Sync Label Studio user data
de: Label Studio Benutzerdaten synchronisieren

source: Remote-mode setup
de: Remote-Modus Einrichtung

source: Save settings
de: Einstellungen speichern

source: Abort
de: Abbrechen

source: Initial sync failed.
de: Die initiale Synchronisierung ist fehlgeschlagen.

source: Back
de: Zurück

source: Initial sync
de: Initiale Synchronisierung

source: Initial sync has completed.
de: Die initiale Synchronisierung wurde abgeschlossen.

source: To fully apply all settings, the Kittyhack service must be restarted now.
de: Um alle Einstellungen vollständig anzuwenden, muss der Kittyhack-Dienst jetzt neu gestartet werden.

source: The web interface will be briefly unavailable during the restart.
de: Die Weboberfläche wird während des Neustarts vorübergehend nicht verfügbar sein.

source: Restart required
de: Neustart erforderlich

source: Restart Kittyhack service
de: Kittyhack-Dienst neu starten

source: Connection to Kittyflap is disconnected.
de: Verbindung zu Kittyflap ist getrennt.

source: Connection to Kittyflap has been disconnected manually.
de: Verbindung zu Kittyflap wurde manuell getrennt.

source: The Kittyflap can now be controlled directly in its web UI:
de: Die Kittyflap kann jetzt direkt in ihrer Weboberfläche gesteuert werden:

source: Remote disconnected
de: Remote-Verbindung getrennt

source: Reconnect
de: Erneut verbinden

source: Do you really want to disconnect from Kittyflap?
de: Möchtest du die Kittyflap wirklich trennen?

source: Disconnected from Kittyflap.
de: Von Kittyflap getrennt.

source: Failed to disconnect from Kittyflap: {}.
de: Fehler beim Trennen von Kittyflap: {}

source: Reconnecting to Kittyflap, please wait...
de: Verbindung zu Kittyflap wird wiederhergestellt, bitte warten...

source: Failed to reconnect to Kittyflap: {}.
de: Fehler beim Wiederherstellen der Verbindung zu Kittyflap: {}

source: Waiting for sync to start...
de: Warten auf den Start der Synchronisierung...

source: Initial sync in progress...
de: Initiale Synchronisierung läuft...

source: Initial sync completed.
de: Initiale Synchronisierung abgeschlossen.

source: Connecting to Kittyflap...
de: Verbindung zu Kittyflap wird hergestellt...

source: Transferred: {:.1f} MB
de: Übertragen: {:.1f} MB

source: Transferred ({} items): {:.1f} MB
de: Übertragen ({} Elemente): {:.1f} MB

source: Reason: {}
de: Grund: {}

source: Could not connect to the remote Kittyflap.
de: Verbindung zur Kittyflap konnte nicht hergestellt werden.

source: Initial sync timed out.
de: Initiale Synchronisierung hat das Zeitlimit überschritten.

source: Failed to reload synced config.ini: {}.
de: Fehler beim Neuladen der synchronisierten config.ini: {}

source: unknown error
de: unbekannter Fehler

source: Remote target host must not be empty.
de: Der Remote-Zielhost darf nicht leer sein.

source: Failed to write config.remote.ini: {}
de: Fehler beim Schreiben der config.remote.ini: {}

source: Failed to initialize remote control client: {}.
de: Fehler beim Initialisieren des Remote-Control-Clients: {}

source: Remote-mode configuration saved. Starting services...
de: Remote-Modus Konfiguration gespeichert. Starte Dienste...

source: Initial sync aborted. Remote target host has been cleared.
de: Initiale Synchronisierung abgebrochen. Remote-Zielhost wurde gelöscht.

source: Restarting Kittyhack service...
de: Kittyhack-Dienst wird neu gestartet...

source: A new version of Kittyhack is available: {}. Go to the [INFO] section for update instructions.
de: Eine neue Version von Kittyhack ist verfügbar: {}. Gehe zur Sektion [INFO] für Update-Anweisungen.

source: or consider deleting pictures from the original kittyflap database file. For more details, see the [INFO] section.
de: oder lösche die Bilder aus der alten Kittyflap Datenbank. Weitere Details findest du in der [INFO] Sektion.

source: Remaining disk space is low: {:.1f} MB. Please free up some space (e.g. reduce the max amount of pictures in the database{}).
de: Verfügbarer Speicherplatz ist niedrig: {:.1f} MB. Bitte gib Speicherplatz frei (z.B. durch Reduzierung der maximalen Anzahl an Bildern in der Datenbank{}).

source: Add new WLAN configuration
de: Neue WLAN-Konfiguration hinzufügen

source: Database migration in progress. Performance may be a bit slower until finished ({} pictures remaining, ~{} min).
de: Datenbank-Migration läuft. Die Leistung kann bis zum Abschluss etwas langsamer sein ({} Bilder verbleibend, ~{} Min.).

source: LabelStudio is running. If you do not need it anymore to label images, please stop it in the [AI TRAINING] section.
de: LabelStudio läuft. Wenn du es nicht mehr benötigst, um Bilder zu labeln, dann stoppe es bitte in der [KI-TRAINING] Sektion.

source: Warning: RAM usage is at {:.1f}%!{}
de: Warnung: RAM-Nutzung ist bei {:.1f}%!{}

source: Manual unlock not yet initialized...
de: Manuelles Entsperren noch nicht initialisiert...

source: Close inside now
de: Eingangsrichtung jetzt schließen

source: Open inside now
de: Eingangsrichtung jetzt öffnen

source: Unknown
de: Unbekannt

source: Connecting to the IP camera...
de: Verbindung zur IP-Kamera wird hergestellt...

source: Please wait a few seconds while the stream is initialized.
de: Bitte warte ein paar Sekunden, während der Stream initialisiert wird.

source: Current status:
de: Aktueller Status:

source: If the stream does not recover, verify the URL, camera network connection, and camera credentials.
de: Wenn der Stream sich nicht wiederherstellt, überprüfe die URL, die Netzwerkverbindung der Kamera und die Kamera-Zugangsdaten.

source: Connection to the IP camera failed.
de: Verbindung zur IP-Kamera fehlgeschlagen.

source: Please check the stream URL and the network connection of your IP camera.
de: Bitte überprüfe die Stream-URL und die Netzwerkverbindung deiner IP-Kamera.

source: If you have just changed the camera settings, please wait a few seconds for the camera to reconnect.
de: Wenn du gerade die Kameraeinstellungen geändert hast, warte bitte ein paar Sekunden, bis die Kamera sich wieder verbunden hat.

source: If this message does not disappear within 60 seconds, please (re-)install the required camera drivers with the "Reinstall Camera Driver" button in the "System" section.
de: Wenn diese Meldung nicht innerhalb von 60 Sekunden verschwindet, installiere die erforderlichen Kameratreiber mit dem "Kameratreiber neu installieren" Button in der "System" Sektion.

source: Connection to the camera failed.
de: Verbindung zur Kamera fehlgeschlagen.

source: Please wait...
de: Bitte warten...

source: Camera stream appears to be frozen.
de: Kamera-Stream scheint eingefroren zu sein.

source: Please check your external IP camera connection or network settings.
de: Bitte überprüfe die Verbindung deiner externen IP-Kamera oder die Netzwerkeinstellungen.

source: Could not read the picture from the camera.
de: Bild konnte nicht von der Kamera gelesen werden.

source: An error occured while fetching the live view image.
de: Fehler beim Abrufen des Live-Bildes.

source: Clock
de: Uhrzeit

source: Current time
de: Aktuelle Uhrzeit

source: Inside
de: Innen

source: Outside
de: Außen

source: Status unavailable
de: Status nicht verfügbar

source: Prey detected {0:.0f}s ago. Inside lock remains closed for {1:.0f}s.
de: Beute vor {0:.0f}s erkannt. Innenverriegelung bleibt für {1:.0f}s geschlossen.

source: Inside lock: Open
de: Verriegelung Innen: Offen

source: Inside lock: Closed
de: Verriegelung Innen: Geschlossen

source: Inside motion: Motion
de: Bewegung Innen: Bewegung erkannt

source: Inside motion: No motion
de: Bewegung Innen: Keine Bewegung

source: Outside lock: Open
de: Verriegelung Außen: Offen

source: Outside lock: Closed
de: Verriegelung Außen: Geschlossen

source: Outside motion: Motion
de: Bewegung Außen: Bewegung erkannt

source: Outside motion: No motion
de: Bewegung Außen: Keine Bewegung

source: Remote control not connected
de: Remote-Steuerung nicht verbunden

source: Today
de: Heute

source: Show detected cats only
de: Nur erkannte Katzen anzeigen

source: Show detected mice only
de: Nur erkannte Mäuse anzeigen

source: Show detection overlay
de: Overlay in Bildern anzeigen

source: Group pictures to events
de: Bilder zu Ereignissen gruppieren

source: Page
de: Seite

source: pictures
de: Bilder

source: No pictures for the selected filter criteria found.
de: Keine Bilder für die ausgewählten Filter gefunden.

source: Unknown RFID: {}
de: Unbekannte RFID: {}

source: No RFID found
de: Keine RFID gefunden

source: Mouse probability
de: Maus-Wahrscheinlichkeit

source: Delete selected photos
de: Ausgewählte Bilder löschen

source: Photo {} deleted successfully.
de: Bild {} erfolgreich gelöscht.

source: An error occurred while deleting the photo: {}
de: Beim löschen des Bildes trat ein Fehler auf: {}

source: No photos selected for deletion.
de: Kein(e) Bild(er) zum löschen ausgewählt.

source: Dismiss
de: Schließen

source: Inside direction:
de: Eingangsrichtung:

source: All cats (unlock on every detected motion)
de: Alle Katzen (bei jeder erkannten Bewegung entsperren)

source: All cats with a RFID chip
de: Alle Katzen mit RFID Chip

source: Only registered cats
de: Nur registrierte Katzen

source: No cats
de: Keine Katzen

source: Individual configuration per cat (Beta)
de: Individuelle Konfiguration pro Katze (Beta)

source: Outside direction:
de: Ausgangsrichtung:

source: Allow exit
de: Ausgang erlauben

source: Do not allow exit
de: Ausgang nicht erlauben

source: The individual configuration per cat can be set in the CATS section. Note that this is a beta feature and may not work completely reliably.
de: Die individuelle Konfiguration pro Katze kann in der KATZEN VERWALTEN Sektion eingestellt werden. Beachte, dass dies eine Beta-Funktion ist und möglicherweise nicht vollständig zuverlässig funktioniert.

source: Reset prey cooldown now
de: Verriegeleung wegen Beute jetzt zurücksetzen

source: Last events
de: Letzte Ereignisse

source: No events found.
de: Keine Ereignisse gefunden.

source: Yesterday
de: Gestern

source: Unknown RFID
de: Unbekannte RFID

source: Failed to read events from the database.
de: Fehler beim lesen der Ereignisse aus der Datenbank.

source: Reinstall Camera Driver
de: Kameratreiber neu installieren

source: Reinstall the camera driver if the live view does not work properly.
de: Kamera-Treiber neu installieren, wenn die Live-Ansicht nicht richtig funktioniert.

source: Kittyflap System Actions
de: Kittyflap Systemverwaltung

source: Start tasks/actions on the Kittyflap
de: Verwaltung des Betriebssystems

source: Restart Kittyflap
de: Kittyflap neu starten

source: Shutdown Kittyflap
de: Kittyflap herunterfahren

source: To avoid data loss, always shut down the Kittyflap properly before unplugging the power cable. After a shutdown, wait 30 seconds before unplugging the power cable. To start the Kittyflap again, just plug in the power again.
de: Um Datenverlust zu vermeiden, fahre die Kittyflap immer ordnungsgemäß herunter, bevor du das Stromkabel aussteckst. Warte nach dem Herunterfahren 30 Sekunden, bevor du das Stromkabel abziehst. Um die Kittyflap wieder zu starten, stecke einfach das Stromkabel wieder ein.

source: Do you really want to reinstall the camera driver? This operation can take several minutes.
de: Möchtest du den Kameratreiber wirklich neu installieren? Dieser Vorgang kann mehrere Minuten dauern.

source: Reinstall Camera Driver in progress.
de: Neuinstallation des Kameratreibers läuft.

source: This may take a while...
de: Dies kann eine Weile dauern...

source: Stopping the camera
de: Kamera wird gestoppt

source: Downloading all dependencies
de: Alle Abhängigkeiten werden heruntergeladen

source: Uninstalling libcamera packages above version 0.3
de: Deinstalliere libcamera Pakete über Version 0.3

source: Installing all dependencies
de: Alle Abhängigkeiten werden installiert

source: An error occurred during the installation process. Please check the logs for details.
de: Ein Fehler ist während des Installationsprozesses aufgetreten. Bitte überprüfe die Logs für Details.

source: A restart is required to apply the update. Do you want to restart the Kittyflap now?
de: Ein Neustart ist erforderlich, um das Update anzuwenden. Möchtest du die Kittyflap jetzt neu starten?

source: Kittyflap is rebooting now... This will take 1 or 2 minutes. Please reload the page after the restart.
de: Die Kittyflap wird jetzt neu gestartet... Dies dauert 1 oder 2 Minuten. Bitte lade die Seite nach dem Neustart neu.

source: Both devices are rebooting now... This may take 1 or 2 minutes. Please reconnect and reload the page afterwards.
de: Beide Geräte werden jetzt neu gestartet... Dies kann 1 oder 2 Minuten dauern. Bitte erneut verbinden und die Seite danach neu laden.

source: Do you really want to restart the Kittyflap?
de: Möchtest du die Kittyflap wirklich neu starten?

source: Kittyflap is shutting down now... Please wait 30 seconds before unplugging the power.
de: Kittyflap wird jetzt heruntergefahren... Bitte warte 30 Sekunden, bevor du das Stromkabel abziehst.

source: Do you really want to shut down the Kittyflap?
de: Möchtest du die Kittyflap wirklich herunterfahren?

source: No picture found!
de: Kein Bild gefunden!

source: ##### Cat-specific settings
de: ##### Katzenspezifische Einstellungen

source: Enable Prey detection
de: Beuteerkennung aktivieren

source: **Disabled:** Global prey detection is turned off in the `CONFIGURATION` section. Enable `Detect prey` to use per-cat settings.
de: **Deaktiviert:** Die globale Beuteerkennung ist in der `KONFIGURATION` Sektion deaktiviert. Aktiviere `Beute erkennen`, um pro-Katze Einstellungen zu verwenden.

source: Allow entry
de: Eingang erlauben

source: **Disabled:** This feature is only available in `Individual configuration per cat` mode for entry.
de: **Deaktiviert:** Diese Funktion ist nur im Modus `Individuelle Konfiguration pro Katze` für den Eingang verfügbar.

source: This cat has no RFID configured. The individual exit per cat works only for cats with a RFID chip!
de: Für diese Katze ist keine RFID konfiguriert. Der individuelle Ausgang pro Katze funktioniert nur für Katzen mit einem RFID-Chip!

source: **Disabled:** This feature is only available in `Individual configuration per cat` mode for exit.
de: **Deaktiviert:** Diese Funktion ist nur im Modus `Individuelle Konfiguration pro Katze` für den Ausgang verfügbar.

source: NOTE: This is NOT the number which stands in the booklet of your vet! You must use the the ID, which is read by the Kittyflap. It is 16 characters long and consists of numbers (0-9) and letters (A-F).
de: HINWEIS: Dies ist NICHT die Nummer, die im Heft deines Tierarztes steht! Du musst die ID verwenden, die von der Kittyflap gelesen wird. Sie ist 16 Zeichen lang und besteht aus Zahlen (0-9) und Buchstaben (A-F).

source: If you have entered the RFID correctly here, the name of the cat will be displayed in the [PICTURES] section.
de: Wenn du die RFID hier korrekt eingegeben hast, wird der Name der Katze in der [BILDER] Sektion angezeigt.

source: Change Picture
de: Bild ändern

source: Delete {} from the database
de: {} aus der Datenbank löschen

source: No RFID entered. Cat identification only via camera (if enabled). See CONFIGURATION section for details.
de: Keine RFID eingegeben. Katzenidentifikation nur über die Kamera (falls aktiviert). Siehe KONFIGURATION Sektion für Details.

source: Valid RFID
de: Gültige RFID

source: Invalid RFID. Must be exactly 16 hex characters (0-9, A-F).
de: Ungültige RFID. Muss genau 16 hexadezimale Zeichen (0-9, A-F) lang sein.

source: Save all changes
de: Alle Änderungen speichern

source: No cats found in the database. Please go to the [ADD NEW CAT] section to add a new cat.
de: Es wurden keine Katzen in der Datenbank gefunden. Gehe zur Sektion [NEUE KATZE HINZUFÜGEN], um eine neue Katze hinzuzufügen.

source: {} deleted successfully from the database.
de: {} erfolgreich aus der Datenbank gelöscht.

source: Failed to delete {} from the database: {}
de: Fehler beim löschen von {} aus der Datenbank: {}

source: Data for {} updated successfully.
de: Daten für {} erfolgreich aktualisiert.
